{
  "skills": [
    {
      "category": "frontend",
      "icon": "images/html-icon.svg",
      "name": "HTML5",
      "percentage": 93,
      "description": "I am skilled and experienced in creating accessible, and responsive HTML pages and building website structure using proper elements and tags. Creates page layouts that work across browsers with expertise in HTML5 features and best practices."
    },
    {
      "category": "frontend",
      "icon": "images/css-Icon.svg",
      "name": "CSS3",
      "percentage": 96,
      "description": "Expert-level in creating modular, reusable, and visually appealing CSS styles, with strong knowledge of CSS3, flexbox, grid, and media queries. Styling websites with colors, spacing, smooth transitions, animations"
    },
    {
      "category": "frontend",
      "icon": "images/JS-icon.svg",
      "name": "JavaScript",
      "percentage": 90,
      "description": "Skilled in developing interactive, and scalable JS webpages, with experience in DOM manipulation, event handling, asynchronous programming and adding interactive features like forms and dynamic content."
    },
    {
      "category": "frontend",
      "icon": "images/jQuery-icon.svg",
      "name": "JQuery",
      "percentage": 85,
      "description": "Skilled in utilizing jQuery with knowledge of jQuery plugins and extensions. Simplifies JavaScript tasks like animations and AJAX calls. Works well with existing websites."
    },
    {
      "category": "frontend",
      "icon": "images/React-icon.svg",
      "name": "React",
      "percentage": 5,
      "description": "Basic understanding of React fundamentals, including components, props, and state, with a room for further learning and development"
    },
    {
      "category": "frontend",
      "icon": "images/typeScript-Icon.svg",
      "name": "TypeScript",
      "percentage": 40,
      "description": "Familiar with TypeScript basics, including type annotations, interfaces, and classes, with a growing understanding of its benefits for large-scale applications"
    },
    {
      "category": "backend",
      "icon": "images/Java-icon.svg",
      "name": "Java",
      "percentage": 75,
      "description": "Skilled in Java programming with experience in object-oriented design, data structures, and algorithms. Able to build scalable backend applications."
    },
    {
      "category": "backend",
      "icon": "images/DB-icon.svg",
      "name": "RDBMS",
      "percentage": 88,
      "description": "Experienced in database design, query optimization, and data management using SQL Server,SQLite, mySQL. Skilled in creating database schemas and writing complex queries."
    },
    {
      "category": "others",
      "icon": "images/Git-Icon.svg",
      "name": "Git",
      "percentage": 79,
      "description": "Skilled in using Git for version control, collaboration, and workflow management, including experience with branching, merging, and resolving conflicts"
    }
  ]
}